demo-output/website/campaign/F7_runs/damBreak_MM_a2p25in_medium_fixeddt_coarsedt/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       23660;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       23700;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       23740;
    }
    atmosphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       24040;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          24000;
        startFace       24340;
    }
)

// ************************************************************************* //
